Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.NewElementTypeId
The id of the newly duplicated ElementType.
Since:
2015

Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.NewName
The name of the newly duplicated ElementType.
Since:
2015

Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.OriginalElementTypeId
The id of the element type that is duplicated.
Since:
2015

Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs
The event arguments used by the ElementTypeDuplicated event.
Since:
2015